//
// 2021-04-13
//
// Created By 변경민
//
// 2577번 : 숫자의 개수
// https://www.acmicpc.net/problem/2577
//
// * 문제
//
// 세 개의 자연수 A, B, C가 주어질 때 A × B × C를 계산한 결과에 0부터 9까지 각각의 숫자가 몇 번씩 쓰였는지를 구하는 프로그램을 작성하시오.
// 
// 예를 들어 A = 150, B = 266, C = 427 이라면 A × B × C = 150 × 266 × 427 = 17037300 이 되고, 계산한 결과 17037300 에는 0이 3번, 1이 1번, 3이 2번, 7이 2번 쓰였다.
//
// * 입력
//
// 150
// 266
// 427
//
// * 출력
//
// 3
// 1
// 0
// 2
// 0
// 0
// 0
// 2
// 0
// 0
//

#include <iostream>
using namespace std;

int main() {
    int a, b, c, s;
    int arr[10];
    cin >> a >> b >> c;
    s = a*b*c;
    for(int i = 0; i < 10; i ++) { arr[i] = 0; }
    while(s != 0) {
        arr[s%10]++;
        s /= 10;
    }
    for(int i = 0 ; i < 10; i ++) {
        cout << arr[i] << endl;
    }
}
